<?php

return [

  /*
  |--------------------------------------------------------------------------
  | رسائل اللغة للمصادقة
  |--------------------------------------------------------------------------
  |
  | الرسائل التالية تستخدم أثناء عملية المصادقة لعرض رسائل مختلفة
  | التي نحتاج إلى عرضها للمستخدم. يمكنك تعديل هذه الرسائل بحسب
  | متطلبات تطبيقك.
  |
  */

  'failed' => 'بيانات الاعتماد هذه لا تتطابق مع سجلاتنا.',
  'password' => 'كلمة المرور المقدمة غير صحيحة.',
  'throttle' => 'الكثير من محاولات تسجيل الدخول. يرجى المحاولة مرة أخرى بعد :seconds ثانية.',

  // يمكنك إضافة المزيد من الرسائل إذا لزم الأمر.

];
